;PesianKey v1.3
;------------------------------------------------------------------------------
; Settings
;------------------------------------------------------------------------------
;#NoEnv ; For security
#Requires AutoHotkey v2.0
#SingleInstance force

; todo add verbs negetive form

A_TrayMenu.Delete()  ; Delete the standard items.
A_TrayMenu.Add("About PersianKey", MenuHandler)  ; Creates a new menu item.
A_TrayMenu.Add()  ; Creates a separator line.
A_TrayMenu.Add("Exit", MenuHandler)  ; Creates a new menu item.
Persistent

MenuHandler(ItemName, ItemPos, MyMenu) {
	if (ItemName = "Exit"){
		ExitApp
	}
    MsgBox "Persian Key version 1.3 - [Farvardin 1404] `nby: mostafa.khadem@live.com"
}

+Space::{
    InputLocaleID := DllCall("GetKeyboardLayout", "UInt", ThreadID := DllCall("GetWindowThreadProcessId", "UInt", WinExist("A"), "UInt", 0), "UInt")
    if( InputLocaleID = 69796905){
        Send "{U+200C}"
    }
}

;------------------------------------------------------------------------------
; Common Misspellings - the main list
;------------------------------------------------------------------------------
;::btw::by the way
;::های::{U+200C}های
::اینصورت::این صورت
::بصورت::به صورت
::گزارشات::گزارش‌ها

::میباشم::می‌باشم
::میباشی::می‌باشی
::میباشد::می‌باشد
::میباشیم::می‌باشیم
::میباشید::می‌باشید
::میباشند::می‌باشند
::می باشم::می‌باشم
::می باشی::می‌باشی
::می باشد::می‌باشد
::می باشیم::می‌باشیم
::می باشید::می‌باشید
::می باشند::می‌باشند

::میکنم::می‌کنم
::میکنی::می‌کنی
::میکند::می‌کند
::میکنیم::می‌کنیم
::میکنید::می‌کنید
::میکنند::می‌کنند
::می کنم::می‌کنم
::می کنی::می‌کنی
::می کند::می‌کند
::می کنیم::می‌کنیم
::می کنید::می‌کنید
::می کنند::می‌کنند

::نمیکنم::نمی‌کنم
::نمیکنی::نمی‌کنی
::نمیکند::نمی‌کند
::نمیکنیم::نمی‌کنیم
::نمیکنید::نمی‌کنید
::نمیکنند::نمی‌کنند
::نمی کنم::نمی‌کنم
::نمی کنی::نمی‌کنی
::نمی کند::نمی‌کند
::نمی کنیم::نمی‌کنیم
::نمی کنید::نمی‌کنید
::نمی کنند::نمی‌کنند

::میکردم::می‌کردم
::میکردی::می‌کردی
::میکرد::می‌کرد
::میکردیم::می‌کردیم
::میکردید::می‌کردید
::میکردند::می‌کردند
::می کردم::می‌کردم
::می کردی::می‌کردی
::می کرد::می‌کرد
::می کردیم::می‌کردیم
::می کردید::می‌کردید
::می کردند::می‌کردند

::نمیکردم::نمی‌کردم
::نمیکردی::نمی‌کردی
::نمیکرد::نمی‌کرد
::نمیکردیم::نمی‌کردیم
::نمیکردید::نمی‌کردید
::نمیکردند::نمی‌کردند
::نمی کردم::نمی‌کردم
::نمی کردی::نمی‌کردی
::نمی کرد::نمی‌کرد
::نمی کردیم::نمی‌کردیم
::نمی کردید::نمی‌کردید
::نمی کردند::نمی‌کردند

::میشوم::می‌شوم
::میشوی::می‌شوی
::میشود::می‌شود
::میشویم::می‌شویم
::میشوید::می‌شوید
::میشوند::می‌شوند
::می شوم::می‌شوم
::می شوی::می‌شوی
::می شود::می‌شود
::می شویم::می‌شویم
::می شوید::می‌شوید
::می شوند::می‌شوند

::نمیشوم::نمی‌شوم
::نمیشوی::نمی‌شوی
::نمیشود::نمی‌شود
::نمیشویم::نمی‌شویم
::نمیشوید::نمی‌شوید
::نمیشوند::نمی‌شوند
::نمی شوم::نمی‌شوم
::نمی شوی::نمی‌شوی
::نمی شود::نمی‌شود
::نمی شویم::نمی‌شویم
::نمی شوید::نمی‌شوید
::نمی شوند::نمی‌شوند

::میتوانم::می‌توانم
::میتوانی::می‌توانی
::میتواند::می‌تواند
::میتوانیم::می‌توانیم
::میتوانید::می‌توانید
::میتوانند::می‌توانند
::می توانم::می‌توانم
::می توانی::می‌توانی
::می تواند::می‌تواند
::می توانیم::می‌توانیم
::می توانید::می‌توانید
::می توانند::می‌توانند

::میدانم::می‌دانم
::میدانی::می‌دانی
::میداند::می‌داند
::میدانیم::می‌دانیم
::میدانید::می‌دانید
::میدانند::می‌دانند
::می دانم::می‌دانم
::می دانی::می‌دانی
::می داند::می‌داند
::می دانیم::می‌دانیم
::می دانید::می‌دانید
::می دانند::می‌دانند

::میبینم::می‌بینم
::میبینی::می‌بینی
::میبیند::می‌بیند
::میبینیم::می‌بینیم
::میبینید::می‌بینید
::میبینند::می‌بینند
::می بینم::می‌بینم
::می بینی::می‌بینی
::می بیند::می‌بیند
::می بینیم::می‌بینیم
::می بینید::می‌بینید
::می بینند::می‌بینند

::میگویم::می‌گویم
::میگویی::می‌گویی
::میگوید::می‌گوید
::میگوییم::می‌گوییم
::میگویید::می‌گویید
::میگویند::می‌گویند
::می گویم::می‌گویم
::می گویی::می‌گویی
::می گوید::می‌گوید
::می گوییم::می‌گوییم
::می گویید::می‌گویید
::می گویند::می‌گویند

::میگفتم::می‌گفتم
::میگفتی::می‌گفتی
::میگفت::می‌گفت
::میگفتیم::می‌گفتیم
::میگفتید::می‌گفتید
::میگفتند::می‌گفتند
::می گفتم::می‌گفتم
::می گفتی::می‌گفتی
::می گفت::می‌گفت
::می گفتیم::می‌گفتیم
::می گفتید::می‌گفتید
::می گفتند::می‌گفتند

::میخواهم::می‌خواهم
::میخواهی::می‌خواهی
::میخواهد::می‌خواهد
::میخواهیم::می‌خواهیم
::میخواهید::می‌خواهید
::میخواهند::می‌خواهند
::می خواهم::می‌خواهم
::می خواهی::می‌خواهی
::می خواهد::می‌خواهد
::می خواهیم::می‌خواهیم
::می خواهید::می‌خواهید
::می خواهند::می‌خواهند

::میفرستم::می‌فرستم
::میفرستی::می‌فرستی
::میفرستد::می‌فرستد
::میفرستیم::می‌فرستیم
::میفرستید::می‌فرستید
::میفرستند::می‌فرستند
::می فرستم::می‌فرستم
::می فرستی::می‌فرستی
::می فرستد::می‌فرستد
::می فرستیم::می‌فرستیم
::می فرستید::می‌فرستید
::می فرستند::می‌فرستند

::بمنظور::به منظور
::بوجود::به وجود
::میدهد::می‌دهد
::باتوجه::با توجه
::الویت::اولویت
::دقیق تر::دقیق‌تر
::دقیقتر::دقیق‌تر

::آنها::آن‌ها
::بیشتر::بیش‌تر
::کمتر::کم‌تر
::مهمترین::مهم‌ترین
::مهمتر::مهم‌تر
::همانطور::همان طور

::استافده::استفاده
::اولویت::اولویت

;-------------------------------------------------------------------------------
;  Capitalise dates
;-------------------------------------------------------------------------------
::یکشنبه::یک شنبه
::سهشنبه::سه شنبه
::پنجشنبه:: پنج شنبه
::فروردینماه::فروردین ماه
::اردیبهشتماه::اردیبهشت ماه
::خردادماه::خرداد ماه
::تیرماه::تیر ماه
::مردادماه::مرداد ماه
::شهریورماه::شهریور ماه
::مهرماه::مهر ماه
::آبانماه::آبان ماه
::آذرماه::آذر ماه
::دیماه::دی ماه
::بهمنماه::بهمن ماه
::اسفندماه::اسفند ماه

;-------------------------------------------------------------------------------
;  Google Search - Ctrl + Alt + g
;-------------------------------------------------------------------------------
^!g::{
    Send "^c"
    Sleep 150
    Run("https://www.google.com/search?q=" A_Clipboard)
    }

^!r::{
    Send "^c"
	if (StrLen(A_Clipboard)>0) {
		Sleep 150
		A_Clipboard := StrReplace(A_Clipboard, "ي", "ی")
		A_Clipboard := StrReplace(A_Clipboard, "ك", "ک")
		;A_Clipboard := StrReplace(A_Clipboard, "1", "۱")
		;۰۱۲۳۴۵۶۷۸۹
		;٠١٢٣٤٥٦٧٨٩ 
		;0123456789
		Send "^v"
	}
    }


;if FileExist("correction.txt")
;    MsgBox, "correction file is here!"