;PesianKey v1.2
;------------------------------------------------------------------------------
; Settings
;------------------------------------------------------------------------------
;#NoEnv ; For security
#Requires AutoHotkey v2.0
#SingleInstance force


+Space::{
    InputLocaleID := DllCall("GetKeyboardLayout", "UInt", ThreadID := DllCall("GetWindowThreadProcessId", "UInt", WinExist("A"), "UInt", 0), "UInt")
    if( InputLocaleID = 69796905){
        Send "{U+200C}"
    }
}


;------------------------------------------------------------------------------
; Common Misspellings - the main list
;------------------------------------------------------------------------------
;::btw::by the way
;::های::{U+200C}های
::اینصورت::این صورت
::بصورت::به صورت
::گزارشات::گزارش‌ها
::میباشد::می‌باشد
::می باشد::می‌باشد


::میکنم::می‌کنم
::میکنی::می‌کنی
::میکند::می‌کند
::میکنیم::می‌کنیم
::میکنید::می‌کنید
::میکنند::می‌کنند
::می کنم::می‌کنم
::می کنی::می‌کنی
::می کند::می‌کند
::می کنیم::می‌کنیم
::می کنید::می‌کنید
::می کنند::می‌کنند

::میکردم::می‌کردم
::میکردی::می‌کردی
::میکرد::می‌کرد
::میکردیم::می‌کردیم
::میکردید::می‌کردید
::میکردند::می‌کردند
::می کردم::می‌کردم
::می کردی::می‌کردی
::می کرد::می‌کرد
::می کردیم::می‌کردیم
::می کردید::می‌کردید
::می کردند::می‌کردند

::میشود::می‌شود
::می شود::می‌شود

::میتوانم::می‌توانم
::میتوانی::می‌توانی
::میتواند::می‌تواند
::میتوانیم::می‌توانیم
::میتوانید::می‌توانید
::میتوانند::می‌توانند
::می توانم::می‌توانم
::می توانی::می‌توانی
::می تواند::می‌تواند
::می توانیم::می‌توانیم
::می توانید::می‌توانید
::می توانند::می‌توانند

::میخواهم::می‌خواهم
::میخواهی::می‌خواهی
::میخواهد::می‌خواهد
::میخواهیم::می‌خواهیم
::میخواهید::می‌خواهید
::میخواهند::می‌خواهند
::می خواهم::می‌خواهم
::می خواهی::می‌خواهی
::می خواهد::می‌خواهد
::می خواهیم::می‌خواهیم
::می خواهید::می‌خواهید
::می خواهند::می‌خواهند

::بمنظور::به منظور
::بوجود::به وجود
::میدهد::می‌دهد
::باتوجه::با توجه
::الویت::اولویت
::دقیق تر::دقیق‌تر
::دقیقتر::دقیق‌تر

::آنها::آن‌ها
::بیشتر::بیش‌تر
::کمتر::کم‌تر
::مهمترین::مهم‌ترین
::مهمتر::مهم‌تر
::همانطور::همان طور

;-------------------------------------------------------------------------------
;  Capitalise dates
;-------------------------------------------------------------------------------
::یکشنبه::یک شنبه
::پنجشنبه:: پنج شنبه
::فروردینماه::فروردین ماه
::اردیبهشتماه::اردیبهشت ماه
::خردادماه::خرداد ماه
::تیرماه::تیر ماه
::مردادماه::مرداد ماه
::شهریورماه::شهریور ماه
::مهرماه::مهر ماه
::آبانماه::آبان ماه
::آذرماه::آذر ماه
::دیماه::دی ماه
::بهمنماه::بهمن ماه
::اسفندماه::اسفند ماه

;-------------------------------------------------------------------------------
;  Google Search - Ctrl + Alt + g
;-------------------------------------------------------------------------------
^!g::{
    Send "^c"
    Sleep 150
    Run("https://www.google.com/search?q=" A_Clipboard)
    }

;if FileExist("correction.txt")
;    MsgBox, "correction file is here!"