;------------------------------------------------------------------------------
; Settings
;------------------------------------------------------------------------------
;#NoEnv ; For security
#Requires AutoHotkey v2.0
#SingleInstance force


+Space::{
    InputLocaleID := DllCall("GetKeyboardLayout", "UInt", ThreadID := DllCall("GetWindowThreadProcessId", "UInt", WinExist("A"), "UInt", 0), "UInt")
    if( InputLocaleID = 69796905){
        Send "{U+200C}"
    }
}


;------------------------------------------------------------------------------
; Common Misspellings - the main list
;------------------------------------------------------------------------------
;::btw::by the way
;::های::{U+200C}های
::اینصورت::این صورت
::بصورت::به صورت
::گزارشات::گزارش‌ها
::میتواند::می‌تواند
::میباشد::می‌باشد
::میکند::می‌کند
::میکنید::می‌کنید
::میکنند::می‌کنند
::میشود::می‌شود
::بمنظور::به منظور
::بوجود::به وجود
::میدهد::می‌دهد
::باتوجه::با توجه
::الویت::اولویت
::می توانیم::می‌توانیم
::دقیق تر::دقیق‌تر
::دقیقتر::دقیق‌تر

::آنها::آن‌ها
::بیشتر::بیش‌تر
::کمتر::کم‌تر
::مهمترین::مهم‌ترین
::مهمتر::مهم‌تر
::همانطور::همان طور

;-------------------------------------------------------------------------------
;  Capitalise dates
;-------------------------------------------------------------------------------
::یکشنبه::یک شنبه
::پنجشنبه:: پنج شنبه
::فروردینماه::فروردین ماه
::اردیبهشتماه::اردیبهشت ماه
::خردادماه::خرداد ماه
::تیرماه::تیر ماه
::مردادماه::مرداد ماه
::شهریورماه::شهریور ماه
::مهرماه::مهر ماه
::آبانماه::آبان ماه
::آذرماه::آذر ماه
::دیماه::دی ماه
::بهمنماه::بهمن ماه
::اسفندماه::اسفند ماه

;-------------------------------------------------------------------------------
;  Google Search
;-------------------------------------------------------------------------------
^!g::{
    Send "^c"
    Sleep 150
    Run("https://www.google.com/search?q=" A_Clipboard)
    }

;if FileExist("correction.txt")
;    MsgBox, "correction file is here!"